13/data/attachments/80a209b54a979e78.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a60f3bfe-14c3-416c-bec0-18aa7960c8ea</nif:username>
            <nif:friendToBeAdded>Michelle_onto_Friend_94950_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>